public/staging_doc.wsdl

<?xml version='1.0' encoding='UTF-8'?>
<!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Metro/2.3 (tags/2.3-7528; 2013-04-29T19:34:10+0000) JAXWS-RI/2.2.8 JAXWS/2.2 svn-revision#unknown. -->
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Metro/2.3 (tags/2.3-7528; 2013-04-29T19:34:10+0000) JAXWS-RI/2.2.8 JAXWS/2.2 svn-revision#unknown. -->
<definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://ws.fundgate.etranzact.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://ws.fundgate.etranzact.com/" name="FundGateImplService">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://ws.fundgate.etranzact.com/" schemaLocation="https://www.etranzact.net/FGate/ws/fundgate?xsd=1"/>
    </xsd:schema>
  </types>
  <message name="process">
    <part name="request" type="tns:fundRequest"/>
  </message>
  <message name="processResponse">
    <part name="response" type="tns:fundResponse"/>
  </message>
  <portType name="FundGate">
    <operation name="process">
      <input wsam:Action="http://ws.fundgate.etranzact.com/FundGate/processRequest" message="tns:process"/>
      <output wsam:Action="http://ws.fundgate.etranzact.com/FundGate/processResponse" message="tns:processResponse"/>
    </operation>
  </portType>
  <binding name="FundGateImplPortBinding" type="tns:FundGate">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc"/>
    <operation name="process">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal" namespace="http://ws.fundgate.etranzact.com/"/>
      </input>
      <output>
        <soap:body use="literal" namespace="http://ws.fundgate.etranzact.com/"/>
      </output>
    </operation>
  </binding>
  <service name="FundGateImplService">
    <port name="FundGateImplPort" binding="tns:FundGateImplPortBinding">
      <soap:address location="https://demo.etranzact.com/FGate/ws?wsdl"/>
    </port>
  </service>
</definitions>